Revit 2024 API
SymbolicCurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual SymbolicCurveArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As SymbolicCurveArrayIterator
Visual C++
public:
virtual SymbolicCurveArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace